# -*- eval: (git-auto-commit-mode 1) -*-
#+TITLE: Emacs initialisation via org-babel

** Various packages
   :PROPERTIES:
   :ID:       ef8328fc-f20e-454e-8925-4bd6e7b18469
   :END:
   #+BEGIN_SRC emacs-lisp
     (use-package s
       :ensure t)

     (use-package beacon
       :ensure t
       :config (beacon-mode 1))

     (use-package hungry-delete
       :ensure t
       :config (global-hungry-delete-mode))

     (use-package aggressive-indent
       :ensure t
       :config (global-aggressive-indent-mode 1))

     (use-package expand-region
       :ensure t
       :bind ("C-=" . er/expand-region))

     (use-package iedit
       :ensure t)

     ;; Copied from this location:
     ;; http://endlessparentheses.com/emacs-narrow-or-widen-dwim.html
     (defun narrow-or-widen-dwim (p)
       "Widen if buffer is narrowed, narrow-dwim otherwise.
     Dwim means: region, org-src-block, org-subtree, or
     defun, whichever applies first. Narrowing to
     org-src-block actually calls `org-edit-src-code'.

     With prefix P, don't widen, just narrow even if buffer
     is already narrowed."
       (interactive "P")
       (declare (interactive-only))
       (cond ((and (buffer-narrowed-p) (not p)) (widen))
             ((region-active-p)
              (narrow-to-region (region-beginning)
                                (region-end)))
             ((derived-mode-p 'org-mode)
              ;; `org-edit-src-code' is not a real narrowing
              ;; command. Remove this first conditional if
              ;; you don't want it.
              (cond ((ignore-errors (org-edit-src-code) t)
                     (delete-other-windows))
                    ((ignore-errors (org-narrow-to-block) t))
                    (t (org-narrow-to-subtree))))
             ((derived-mode-p 'latex-mode)
              (LaTeX-narrow-to-environment))
             (t (narrow-to-defun))))

     ;; (define-key endless/toggle-map "n" #'narrow-or-widen-dwim)
     ;; This line actually replaces Emacs' entire narrowing
     ;; keymap, that's how much I like this command. Only
     ;; copy it if that's what you want.
     (define-key ctl-x-map "n" #'narrow-or-widen-dwim)
     (add-hook 'LaTeX-mode-hook
               (lambda ()
                 (define-key LaTeX-mode-map "\C-xn"
                   nil)))
   #+END_SRC

   #+RESULTS:
   | lambda | nil | (define-key LaTeX-mode-map n nil) |

** Bookmark+
   :PROPERTIES:
   :ID:       a7f127c9-81f2-4cd0-a79d-b8531367cc7a
   :END:
   #+BEGIN_SRC emacs-lisp
     (require 'bookmark+)

   #+END_SRC

   #+RESULTS:
   : ~/.personal/bookmarks

*** Org Board
    :PROPERTIES:
    :ID:       d7612dab-55d2-44a9-8648-8f2a3db97859
    :END:
    #+BEGIN_SRC emacs-lisp
      (use-package org-board
        :ensure t
        :after org
        )

      (global-set-key (kbd "C-c o") org-board-keymap)
    #+END_SRC

    #+RESULTS:
    : (keymap (79 . org-attach-reveal-in-emacs) (120 . org-board-run-after-archive-function) (99 . org-board-cancel) (51 . org-board-diff3) (100 . org-board-diff) (111 . org-board-open) (107 . org-board-delete-all) (110 . org-board-new) (114 . org-board-archive-dry-run) (97 . org-board-archive))
